test/artillery.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 300
      arrivalRate: 1
    - duration: 300
      arrivalRate: 10
    - duration: 300
      arrivalRate: 100
    - duration: 300
      arrivalRate: 1000
  processor: "./randomBannerID.js"
scenarios:
  - flow:
    - function: "randomID"
    - get:
        url: "/banners/{{id}}"
    - log: "Request - http://localhost:3002/banners/{{id}}"