test/artillery.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 1000
    - duration: 60
      arrivalRate: 1000
    - duration: 60
      arrivalRate: 1000
  processor: "./randomBannerID.js"
scenarios:
  - flow:
    - function: "randomID"
    - get:
        url: "/banners/{{id}}"